Tekla Open API Reference for Tekla Structures 2025
InvalidFacePointsException Constructor
 Initializes a new instance of the InvalidFacePointsException class with "Cannot create geometry from requested face points" error message.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InvalidFacePointsException()
Public Sub New
See Also
Reference
InvalidFacePointsException Class
Tekla.Structures.Model Namespace